{"name":"Liam","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Liam Bong - a curious","headerTaglineThree":"developer looking for work","headerTaglineFour":"in Melbourne and Sydney","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/lbong123"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/liam-bong-602997235/"},{"id":"5","title":"Email","link":"mailto:lbong@outlook.com"}],"projects":[{"id":"2","title":"Sudoku Solver with GUI","description":"Algorithms and CSPs","imageSrc":"https://user-images.githubusercontent.com/108723117/206897790-f8fc0719-3f5c-402d-824d-1aeeb979d2cd.png","url":"https://drive.google.com/uc?export=download&id=1svA4s1d7K8_Vzp9041bbgkPdNbprkWo9"},{"id":"3","title":"Spotify Analytics Emailer","description":"Data Processing and Design","imageSrc":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Spotify_App_Logo.svg/2048px-Spotify_App_Logo.svg.png","url":"https://github.com/lbong123/spotify-trend-emailer"}],"services":[{"id":"1","title":"Cooking","description":"I love exploring different recipes I find online and setting out time on the weekend to make my own masterpieces."},{"id":"2","title":"Chess","description":"I am currently rated 1200 on chess.com and 1500 on lichess.org, I'd love to have a game : )"},{"id":"3","title":"Reading","description":"I am a new reader enjoying the enriching and broadening aspects that reading can provide. I can't wait to start reading Atomic Habits."}],"aboutpara":"I am a postgraduate software engineer pursuing a Masters of Software Engineering at the University of Melbourne. I am passionate about building innovative and scalable software solutions that solve real-world problems. With strong skills in programming languages such as Java, JavaScript and Python, I have experience in designing, developing, testing, and maintaining software applications. As I begin my career, I am excited to continue learning and growing as a software engineer. I am interested in opportunities that allow me to work on complex and challenging projects, contribute to open-source communities, and make a positive impact on society.","resume":{"tagline":"👋  I'm a postgraduate software engineer","description":"Passionate about building innovative and scalable software solutions that solve real-world problems.","experiences":[{"id":"1","dates":"Nov 2022 - Dec 2023","type":"Part Time/Full Time","position":"Undergraduate Software Engineer at Saab Australia","bullets":"Designed and implemented a user/maintainer application with a graphical interface capable of communicating with existing CSOA libraries in order to display Asset and Service information discovered on the CSOA bus, Devised and operated memory leak and usage testing procedures to remove 100% of avoidable memory leaks in C++ (Valgrind) and Java (Yourkit) CSOA Libraries, Engineered an unit test repeater shell script capable of performing tests from a subset of all 6 CSOA libraries to streamline Jenkin Builds and reduce build times by 20%, Developed build and run scripts to zip CSOA libraries for delivery; orchestrated delivery refinement process and drafted relevant documentation, Facilitated team discussions to assess client expectations and directed a demonstration of the CSOA Bus Monitor functionality to key stakeholders and over 30 Maritime Division members"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Aug 2023 - Nov 2023","type":"Part Time","position":"Fullstack Student Developer for Volunteering Victoria Industry Software Project","bullets":"Developed a simple web-based administration tool to provide administrators with valuable insights and statistics derived from surveys completed by over 2.3 million Volunteering Victoria volunteers and associated parties, Processed survey data from our back end API to visualise results and allow users to categorise responses by question and theme, Spearheaded all 12 team standups; 3 sprint plannings; reviews and retrospectives as Scrum Master and Front End Developer; liased with client on a weekly basis, Planned and prioritised project deliverables; managed group kanban board and documentation of over 20 confluence pages"}],"education":{"universityName":"Univeristy of Melbourne","universityDate":"2021-2025","universityPara":"Currently enrolled in a Masters of Software Engineering having achieved a First Class Honours (83.0 WAM) in my Bachelors and being awarded the Miller Exhibition College Scholarship (Awarded for Academic Excellence) in 2022."},"languages":["Java","JavaScript","Python","C","MySQL"],"frameworks":["React","Typescript","NodeJs"],"others":["MERN stack","Agile Methodology"]}}